const exceptions = [
	"，", "。", "、", "》", "《", "？","：","；", "“", "”", "‘", "’", //caractères spéciaux chinois
	"|", "】", "【", "\n", "(", ")", " ", ",", ";", "^", //caractères spéciaux internationaux
	'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z',//alphabet min
	'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z',//alphabet maj
	'0', '1', '2', '3', '4', '5', '6', '7', '8', '9' //numéros
	];

const LVCList = ['爱', '安', '爸', '把', '八', '白', '百', '半', '办', '班', '报', '包', '吧', '北', '杯', '本', '笔', '比', '变', '边', '别', '病', '部', '不', '才', '菜', '茶', '差', '长', '常', '场', '车', '成', '城', '吃', '处', '出', '穿', '床', '春', '次', '从', '村', '错', '大', '打', '带', '代', '但', '当', '道', '到', '的', '得', '等', '第', '地', '电', '店', '点', '定', '动', '懂', '冬', '东', '都', '读', '对', '多', '饿', '儿', '二', '法', '发', '饭', '房', '放', '方', '飞', '非', '份', '分', '风', '服', '父', '夫', '该', '干', '刚', '告', '高', '个', '哥', '给', '跟', '更', '共', '工', '公', '古', '惯', '馆', '关', '广', '贵', '国', '过', '果', '还', '孩', '海', '汉', '号', '好', '河', '和', '喝', '黑', '很', '红', '后', '候', '湖', '话', '画', '化', '花', '坏', '欢', '黄', '回', '会', '活', '或', '火', '己', '几', '鸡', '机', '家', '见', '件', '间', '讲', '江', '觉', '较', '叫', '饺', '教', '节', '界', '街', '进', '近', '斤', '今', '经', '京', '旧', '就', '酒', '九', '久', '开', '看', '课', '刻', '可', '口', '筷', '快', '块', '来', '老', '了', '累', '冷', '离', '里', '李', '连', '凉', '辆', '两', '零', '另', '六', '龙', '楼', '路', '马', '妈', '卖', '买', '慢', '忙', '毛', '吗', '么', '没', '美', '每', '们', '门', '米', '面', '民', '明', '名', '母', '拿', '那', '哪', '难', '男', '南', '脑', '呢', '能', '你', '年', '念', '您', '牛', '农', '女', '怕', '旁', '朋', '票', '平', '骑', '其', '汽', '气', '起', '期', '七', '钱', '前', '千', '亲', '请', '轻', '秋', '去', '区', '然', '让', '热', '人', '认', '日', '肉', '如', '三', '山', '上', '商', '少', '什', '身', '生', '声', '识', '时', '实', '十', '视', '是', '市', '室', '事', '世', '始', '师', '手', '收', '树', '书', '谁', '睡', '水', '说', '四', '思', '诉', '岁', '虽', '所', '它', '她', '他', '太', '特', '题', '体', '天', '条', '听', '同', '头', '图', '外', '玩', '完', '万', '晚', '王', '忘', '网', '往', '为', '位', '文', '问', '我', '物', '午', '五', '习', '系', '喜', '西', '息', '下', '现', '先', '向', '像', '想', '笑', '校', '小', '谢', '写', '些', '信', '新', '心', '行', '姓', '兴', '星', '休', '许', '学', '羊', '样', '要', '药', '夜', '也', '意', '已', '以', '衣', '医', '一', '音', '因', '影', '应', '用', '又', '有', '友', '鱼', '雨', '语', '园', '院', '远', '越', '月', '在', '再', '早', '怎', '站', '张', '找', '着', '这', '者', '真', '正', '只', '知', '重', '种', '钟', '中', '住', '主', '自', '字', '子', '走', '最', '昨', '坐', '做', '作'];
const LVBList = ['啊','爱','安','爸','把','八','白','百','半','办','班','帮','报','包','吧','被','备','北','杯','本','笔','比','变','便','边','表','别','病','并','部','不','才','菜','茶','差','产','长','常','唱','厂','场','车','成','城','吃','除','处','楚','初','出','传','穿','床','春','词','次','此','从','村','错','答','大','打','带','代','但','当','道','到','的','得','等','第','地','底','低','电','店','点','定','动','懂','冬','东','都','读','短','对','多','饿','而','儿','二','法','发','饭','反','房','放','方','费','飞','非','份','分','风','封','服','父','夫','该','感','干','刚','告','高','各','个','歌','哥','给','跟','更','共','工','公','古','怪','惯','馆','管','关','广','贵','国','过','果','还','孩','海','汉','号','好','河','和','合','喝','黑','很','红','后','候','湖','话','画','化','花','坏','欢','黄','回','会','婚','活','或','火','极','急','记','寄','己','几','鸡','机','假','家','见','件','间','讲','江','觉','较','叫','饺','教','交','节','结','界','介','解','姐','街','接','进','近','金','斤','今','经','京','旧','就','酒','九','久','决','开','看','课','刻','渴','可','口','筷','快','块','况','来','老','了','累','冷','离','力','里','礼','理','李','连','凉','辆','亮','两','零','另','六','龙','楼','路','马','妈','卖','买','慢','忙','毛','吗','么','没','美','每','们','门','米','面','民','明','名','目','母','拿','那','哪','难','男','南','脑','呢','能','你','年','念','您','牛','农','女','欧','怕','旁','胖','跑','朋','皮','片','票','品','平','骑','奇','其','汽','气','起','期','七','钱','前','千','亲','情','请','轻','清','秋','趣','去','取','区','全','然','让','热','人','认','日','肉','如','三','色','山','上','商','绍','少','社','什','身','生','声','识','时','实','十','视','是','市','室','事','世','始','师','受','首','手','收','树','书','双','谁','睡','水','说','四','死','思','送','诉','算','岁','虽','所','它','她','他','太','谈','特','题','提','体','天','条','听','同','统','头','图','突','外','玩','完','万','晚','王','望','忘','网','往','为','位','文','问','我','无','物','午','五','习','系','洗','喜','西','息','希','夏','下','现','先','向','像','想','相','笑','校','小','消','谢','写','些','信','新','心','行','姓','兴','星','休','许','学','亚','言','阳','羊','样','要','药','夜','业','也','意','已','以','衣','医','一','音','因','影','应','用','又','有','友','鱼','于','雨','语','园','原','院','愿','远','越','月','在','再','咱','早','怎','站','张','照','找','着','这','者','真','正','纸','只','知','之','重','种','钟','中','洲','祝','助','住','主','准','自','字','子','总','走','租','最','昨','坐','做','作'];
const LVAList = ['啊' ,'爱' ,'按' ,'安' ,'爸' ,'把' ,'八' ,'白' ,'拜' ,'百' ,'半' ,'办' ,'板' ,'般' ,'班' ,'帮' ,'抱' ,'报' ,'保' ,'包' ,'吧' ,'被' ,'背' ,'备' ,'北' ,'杯' ,'本' ,'必' ,'笔' ,'比' ,'遍' ,'变' ,'便' ,'边' ,'表' ,'标' ,'别' ,'病' ,'并' ,'部' ,'步' ,'不' ,'补' ,'财' ,'才' ,'菜' ,'彩' ,'参' ,'草' ,'曾' ,'层' ,'茶' ,'查' ,'差' ,'产' ,'长' ,'常' ,'唱' ,'厂' ,'场' ,'车' ,'程' ,'承' ,'成' ,'城' ,'吃' ,'除' ,'处' ,'楚' ,'初' ,'出' ,'传' ,'船' ,'穿' ,'床' ,'窗' ,'春' ,'词' ,'次' ,'此' ,'从' ,'存' ,'村' ,'错' ,'达' ,'答' ,'大' ,'打' ,'带' ,'代' ,'呆' ,'蛋' ,'但' ,'单' ,'党' ,'当' ,'道' ,'到' ,'导' ,'的' ,'得' ,'等' ,'灯' ,'第' ,'弟' ,'地' ,'底' ,'低' ,'电' ,'店' ,'点' ,'典' ,'调' ,'掉' ,'定' ,'动' ,'懂' ,'冬' ,'东' ,'都' ,'读' ,'独' ,'度' ,'段' ,'断' ,'短' ,'队' ,'对' ,'朵' ,'多' ,'饿' ,'而' ,'儿' ,'二' ,'法' ,'发' ,'饭' ,'反' ,'房' ,'放' ,'访' ,'方' ,'费' ,'飞' ,'非' ,'份' ,'分' ,'风' ,'封' ,'福' ,'服' ,'父' ,'富' ,'妇' ,'复' ,'府' ,'夫' ,'概' ,'改' ,'该' ,'敢' ,'感' ,'干' ,'刚' ,'告' ,'搞' ,'高' ,'格' ,'各' ,'个' ,'歌' ,'哥' ,'给' ,'跟' ,'根' ,'更' ,'共' ,'工' ,'功' ,'公' ,'够' ,'狗' ,'顾' ,'故' ,'古' ,'挂' ,'瓜' ,'怪' ,'惯' ,'馆' ,'管' ,'观' ,'官' ,'关' ,'广' ,'光' ,'贵' ,'鬼' ,'规' ,'国' ,'过' ,'果' ,'还' ,'孩' ,'害' ,'海' ,'汉' ,'号' ,'好' ,'河' ,'和' ,'合' ,'何' ,'喝' ,'黑' ,'恨' ,'很' ,'红' ,'后' ,'候' ,'胡' ,'湖' ,'护' ,'户' ,'互' ,'虎' ,'呼' ,'华' ,'划' ,'话' ,'画' ,'化' ,'花' ,'怀' ,'坏' ,'环' ,'换' ,'欢' ,'黄' ,'回' ,'会' ,'婚' ,'活' ,'货' ,'获' ,'或' ,'火' ,'级' ,'极' ,'急' ,'及' ,'记' ,'计' ,'继' ,'济' ,'技' ,'寄' ,'季' ,'己' ,'几' ,'鸡' ,'积' ,'机' ,'基' ,'架' ,'价' ,'假' ,'家' ,'加' ,'见' ,'建' ,'健' ,'件' ,'简' ,'间' ,'讲' ,'江' ,'将' ,'觉' ,'较' ,'叫' ,'饺' ,'角' ,'脚' ,'教' ,'交' ,'节' ,'结' ,'界' ,'介' ,'解' ,'姐' ,'街' ,'接' ,'进' ,'近' ,'尽' ,'紧' ,'仅' ,'金' ,'斤' ,'今' ,'静' ,'境' ,'景' ,'经' ,'精' ,'睛' ,'京' ,'旧' ,'救' ,'就' ,'酒' ,'九' ,'久' ,'据' ,'句' ,'剧' ,'具' ,'举' ,'居' ,'决' ,'军' ,'开' ,'看' ,'康' ,'靠' ,'考' ,'课' ,'客' ,'刻' ,'渴' ,'可' ,'科' ,'肯' ,'孔' ,'口' ,'苦' ,'哭' ,'筷' ,'快' ,'块' ,'况' ,'困' ,'拉' ,'来' ,'浪' ,'劳' ,'老' ,'了' ,'乐' ,'累' ,'类' ,'冷' ,'离' ,'历' ,'力' ,'利' ,'例' ,'丽' ,'里' ,'礼' ,'理' ,'李' ,'连' ,'联' ,'练' ,'脸' ,'粮' ,'凉' ,'量' ,'辆' ,'谅' ,'亮' ,'两' ,'料' ,'林' ,'零' ,'另' ,'领' ,'留' ,'流' ,'六' ,'龙' ,'楼' ,'路' ,'绿' ,'旅' ,'论' ,'落' ,'马' ,'妈' ,'卖' ,'买' ,'慢' ,'满' ,'忙' ,'毛' ,'吗' ,'么' ,'没' ,'美' ,'每' ,'们' ,'门' ,'梦' ,'迷' ,'米' ,'面' ,'民' ,'明' ,'名' ,'命' ,'目' ,'母' ,'拿' ,'那' ,'哪' ,'奶' ,'难' ,'男' ,'南' ,'闹' ,'脑' ,'呢' ,'内' ,'能' ,'你' ,'年' ,'念' ,'娘' ,'您' ,'牛' ,'农' ,'弄' ,'女' ,'暖' ,'欧' ,'怕' ,'排' ,'旁' ,'胖' ,'跑' ,'朋' ,'皮' ,'片' ,'篇' ,'票' ,'漂' ,'品' ,'评' ,'平' ,'破' ,'普' ,'齐' ,'骑' ,'奇' ,'其' ,'汽' ,'气' ,'器' ,'起' ,'期' ,'七' ,'钱' ,'前' ,'千' ,'强' ,'墙' ,'桥' ,'且' ,'切' ,'亲' ,'情' ,'庆' ,'请' ,'青' ,'轻' ,'清' ,'穷' ,'球' ,'求' ,'秋' ,'趣' ,'去' ,'取' ,'区' ,'全' ,'确' ,'却' ,'缺' ,'然' ,'让' ,'热' ,'人' ,'认' ,'任' ,'日' ,'容' ,'肉' ,'如' ,'入' ,'赛' ,'三' ,'色' ,'杀' ,'山' ,'上' ,'商' ,'伤' ,'绍' ,'少' ,'社' ,'什' ,'神' ,'身' ,'深' ,'省' ,'生' ,'声' ,'升' ,'识' ,'食' ,'时' ,'实' ,'十' ,'适' ,'试' ,'视' ,'示' ,'是' ,'式' ,'市' ,'室' ,'事' ,'世' ,'始' ,'史' ,'使' ,'诗' ,'师' ,'受' ,'首' ,'手' ,'收' ,'熟' ,'术' ,'树' ,'数' ,'舒' ,'书' ,'双' ,'谁' ,'睡' ,'水' ,'顺' ,'说' ,'四' ,'死' ,'思' ,'司' ,'送' ,'诉' ,'算' ,'随' ,'岁' ,'虽' ,'所' ,'它' ,'她' ,'他' ,'台' ,'太' ,'谈' ,'特' ,'疼' ,'题' ,'提' ,'替' ,'体' ,'天' ,'条' ,'铁' ,'庭' ,'停' ,'听' ,'同' ,'统' ,'通' ,'头' ,'图' ,'突' ,'推' ,'外' ,'玩' ,'完' ,'万' ,'碗' ,'晚' ,'王' ,'望' ,'忘' ,'网' ,'往' ,'为' ,'味' ,'卫' ,'位' ,'闻' ,'文' ,'问' ,'温' ,'我' ,'无' ,'物' ,'午' ,'五' ,'屋' ,'习' ,'细' ,'系' ,'洗' ,'喜' ,'西' ,'息' ,'希' ,'夏' ,'吓' ,'下' ,'线' ,'现' ,'显' ,'鲜' ,'先' ,'象' ,'向' ,'像' ,'想' ,'响' ,'香' ,'相' ,'乡' ,'笑' ,'校' ,'效' ,'小' ,'消' ,'鞋' ,'谢' ,'写' ,'些' ,'信' ,'新' ,'心' ,'行' ,'形' ,'性' ,'幸' ,'姓' ,'兴' ,'醒' ,'星' ,'修' ,'休' ,'续' ,'许' ,'须' ,'需' ,'选' ,'学' ,'血' ,'雪' ,'亚' ,'颜' ,'言' ,'验' ,'眼' ,'演' ,'阳' ,'羊' ,'样' ,'养' ,'要' ,'药' ,'呀' ,'爷' ,'夜' ,'业' ,'也' ,'艺' ,'易' ,'意' ,'义' ,'已' ,'以' ,'衣' ,'医' ,'一' ,'印' ,'音' ,'阴' ,'因' ,'影' ,'应' ,'英' ,'用' ,'由' ,'油' ,'右' ,'又' ,'有' ,'友' ,'鱼' ,'于' ,'遇' ,'育' ,'雨' ,'语' ,'与' ,'园' ,'员' ,'原' ,'元' ,'院' ,'愿' ,'远' ,'越' ,'月' ,'约' ,'运' ,'杂' ,'在' ,'再' ,'仔' ,'咱' ,'造' ,'早' ,'怎' ,'增' ,'站' ,'展' ,'丈' ,'章' ,'张' ,'照' ,'找' ,'招' ,'着' ,'这' ,'者' ,'真' ,'证' ,'正' ,'政' ,'整' ,'职' ,'直' ,'值' ,'至' ,'治' ,'志' ,'制' ,'纸' ,'指' ,'只' ,'知' ,'支' ,'之' ,'重' ,'众' ,'种' ,'钟' ,'终' ,'中' ,'洲' ,'州' ,'周' ,'著' ,'祝' ,'注' ,'助' ,'住' ,'主' ,'转' ,'专' ,'装' ,'准' ,'桌' ,'自' ,'字' ,'子' ,'资' ,'总' ,'走' ,'足' ,'族' ,'组' ,'租' ,'最' ,'嘴' ,'昨' ,'坐' ,'做' ,'作' ,'左'];

//---------------------Tool functions---------------------:

//turns string into list of dicts containing every char + its associated color
noChangeToValues = inputString => [...inputString].map(element => ({char: element.replace("\n", "<br>"), color: ''}))

stringToDictArray = inputString => {
	var endList = [];
	if (document.querySelector('input[name=languageLevel]:checked') === null) {return noChangeToValues(inputString)};
	let languageLevelValue = document.querySelector('input[name=languageLevel]:checked').value;

	[...inputString].forEach(element => elementInList(element, eval(languageLevelValue)) ? endList.push({char: element.replace("\n", "<br>"), color: ""}) : endList.push({char: element.replace("\n", "<br>"), color: "red"}));
	return endList;
}

//sets html element text & color to corresponding values (used to simplify other func)
fillHTMLElement = (htmlElement, textChar, color) => {
	htmlElement.innerHTML = textChar;
	htmlElement.style.color = color;
	return htmlElement
}

//literally just a function to ease writing
appendToOutput = (char, color) => document.getElementById('textOutput').appendChild(fillHTMLElement(document.createElement('span'), char, color))

//remove every child of target element
removeChildren = parent => {while (parent.firstChild) {parent.removeChild(parent.firstChild)}}

//---------------------actual functions---------------------:

function elementInList(element, listObj=LVBList) {
	if (listObj === null) {return true};
	const usedListObj = [...listObj, ...exceptions];
	if (usedListObj.indexOf(element) == -1) {return false} else {return true}
}

function pushToOutput() {
	let outputField = document.getElementById('textOutput');
	removeChildren(outputField);

	stringToDictArray(document.getElementById('textInput').value).forEach(element => appendToOutput(element.char, element.color));
	document.getElementById("textOutput").scrollIntoView();
}

